ycsb_logs/run.log
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2717
[OVERALL], Throughput(ops/sec), 36805.2999631947
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 15
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5520794994479205
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 15
[TOTAL_GC_TIME_%], Time(%), 0.5520794994479205
[READ], Operations, 4943
[READ], AverageLatency(us), 24.192595589722842
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 3437
[READ], 95thPercentileLatency(us), 39
[READ], 99thPercentileLatency(us), 50
[READ], Return=OK, 4943
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 283.0
[CLEANUP], MinLatency(us), 283
[CLEANUP], MaxLatency(us), 283
[CLEANUP], 95thPercentileLatency(us), 283
[CLEANUP], 99thPercentileLatency(us), 283
[UPDATE], Operations, 95057
[UPDATE], AverageLatency(us), 26.238909286007342
[UPDATE], MinLatency(us), 11
[UPDATE], MaxLatency(us), 3287
[UPDATE], 95thPercentileLatency(us), 46
[UPDATE], 99thPercentileLatency(us), 69
[UPDATE], Return=OK, 95057
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2566
[OVERALL], Throughput(ops/sec), 38971.16134060795
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 16
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6235385814497272
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 16
[TOTAL_GC_TIME_%], Time(%), 0.6235385814497272
[READ], Operations, 5023
[READ], AverageLatency(us), 23.258212223770656
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 3051
[READ], 95thPercentileLatency(us), 31
[READ], 99thPercentileLatency(us), 45
[READ], Return=OK, 5023
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 285.0
[CLEANUP], MinLatency(us), 285
[CLEANUP], MaxLatency(us), 285
[CLEANUP], 95thPercentileLatency(us), 285
[CLEANUP], 99thPercentileLatency(us), 285
[UPDATE], Operations, 94977
[UPDATE], AverageLatency(us), 24.767575307706075
[UPDATE], MinLatency(us), 11
[UPDATE], MaxLatency(us), 3209
[UPDATE], 95thPercentileLatency(us), 39
[UPDATE], 99thPercentileLatency(us), 59
[UPDATE], Return=OK, 94977
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2527
[OVERALL], Throughput(ops/sec), 39572.615749901066
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 15
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.593589236248516
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 15
[TOTAL_GC_TIME_%], Time(%), 0.593589236248516
[READ], Operations, 5108
[READ], AverageLatency(us), 22.41268598277212
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 1594
[READ], 95thPercentileLatency(us), 29
[READ], 99thPercentileLatency(us), 40
[READ], Return=OK, 5108
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 280.0
[CLEANUP], MinLatency(us), 280
[CLEANUP], MaxLatency(us), 280
[CLEANUP], 95thPercentileLatency(us), 280
[CLEANUP], 99thPercentileLatency(us), 280
[UPDATE], Operations, 94892
[UPDATE], AverageLatency(us), 24.45159760569911
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 2917
[UPDATE], 95thPercentileLatency(us), 36
[UPDATE], 99thPercentileLatency(us), 49
[UPDATE], Return=OK, 94892
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2673
[OVERALL], Throughput(ops/sec), 37411.14852225963
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 16
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5985783763561541
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 16
[TOTAL_GC_TIME_%], Time(%), 0.5985783763561541
[READ], Operations, 4920
[READ], AverageLatency(us), 23.244512195121953
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 1562
[READ], 95thPercentileLatency(us), 36
[READ], 99thPercentileLatency(us), 53
[READ], Return=OK, 4920
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 283.0
[CLEANUP], MinLatency(us), 283
[CLEANUP], MaxLatency(us), 283
[CLEANUP], 95thPercentileLatency(us), 283
[CLEANUP], 99thPercentileLatency(us), 283
[UPDATE], Operations, 95080
[UPDATE], AverageLatency(us), 25.850473285654186
[UPDATE], MinLatency(us), 11
[UPDATE], MaxLatency(us), 3319
[UPDATE], 95thPercentileLatency(us), 43
[UPDATE], 99thPercentileLatency(us), 67
[UPDATE], Return=OK, 95080
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2730
[OVERALL], Throughput(ops/sec), 36630.03663003663
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 16
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5860805860805861
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 16
[TOTAL_GC_TIME_%], Time(%), 0.5860805860805861
[READ], Operations, 5028
[READ], AverageLatency(us), 24.022474144789182
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 2543
[READ], 95thPercentileLatency(us), 37
[READ], 99thPercentileLatency(us), 54
[READ], Return=OK, 5028
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 296.0
[CLEANUP], MinLatency(us), 296
[CLEANUP], MaxLatency(us), 296
[CLEANUP], 95thPercentileLatency(us), 296
[CLEANUP], 99thPercentileLatency(us), 296
[UPDATE], Operations, 94972
[UPDATE], AverageLatency(us), 26.40430863833551
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 3027
[UPDATE], 95thPercentileLatency(us), 44
[UPDATE], 99thPercentileLatency(us), 69
[UPDATE], Return=OK, 94972
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2487
[OVERALL], Throughput(ops/sec), 40209.08725371934
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 17
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6835544833132288
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 17
[TOTAL_GC_TIME_%], Time(%), 0.6835544833132288
[READ], Operations, 5011
[READ], AverageLatency(us), 21.864098982239074
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 1438
[READ], 95thPercentileLatency(us), 29
[READ], 99thPercentileLatency(us), 37
[READ], Return=OK, 5011
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 280.0
[CLEANUP], MinLatency(us), 280
[CLEANUP], MaxLatency(us), 280
[CLEANUP], 95thPercentileLatency(us), 280
[CLEANUP], 99thPercentileLatency(us), 280
[UPDATE], Operations, 94989
[UPDATE], AverageLatency(us), 24.082514817505185
[UPDATE], MinLatency(us), 11
[UPDATE], MaxLatency(us), 3025
[UPDATE], 95thPercentileLatency(us), 35
[UPDATE], 99thPercentileLatency(us), 44
[UPDATE], Return=OK, 94989
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2585
[OVERALL], Throughput(ops/sec), 38684.71953578336
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.46421663442940037
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.46421663442940037
[READ], Operations, 5017
[READ], AverageLatency(us), 22.559697030097666
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 1480
[READ], 95thPercentileLatency(us), 30
[READ], 99thPercentileLatency(us), 48
[READ], Return=OK, 5017
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 281.0
[CLEANUP], MinLatency(us), 281
[CLEANUP], MaxLatency(us), 281
[CLEANUP], 95thPercentileLatency(us), 281
[CLEANUP], 99thPercentileLatency(us), 281
[UPDATE], Operations, 94983
[UPDATE], AverageLatency(us), 25.01225482454755
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 3107
[UPDATE], 95thPercentileLatency(us), 37
[UPDATE], 99thPercentileLatency(us), 59
[UPDATE], Return=OK, 94983
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2737
[OVERALL], Throughput(ops/sec), 36536.35367190355
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 15
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5480453050785532
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 15
[TOTAL_GC_TIME_%], Time(%), 0.5480453050785532
[READ], Operations, 5011
[READ], AverageLatency(us), 23.91199361404909
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 1533
[READ], 95thPercentileLatency(us), 39
[READ], 99thPercentileLatency(us), 52
[READ], Return=OK, 5011
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 280.0
[CLEANUP], MinLatency(us), 280
[CLEANUP], MaxLatency(us), 280
[CLEANUP], 95thPercentileLatency(us), 280
[CLEANUP], 99thPercentileLatency(us), 280
[UPDATE], Operations, 94989
[UPDATE], AverageLatency(us), 26.458695217340956
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 3663
[UPDATE], 95thPercentileLatency(us), 45
[UPDATE], 99thPercentileLatency(us), 68
[UPDATE], Return=OK, 94989
./test/benchmark/jre/jre1.8.0_471//bin/java  -classpath /root/asterinas/ycsb-0.17.0/conf:/root/asterinas/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/root/asterinas/ycsb-0.17.0/lib/core-0.17.0.jar:/root/asterinas/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/root/asterinas/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 2872
[OVERALL], Throughput(ops/sec), 34818.94150417827
[TOTAL_GCS_PS_Scavenge], Count, 7
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 14
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.48746518105849584
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 14
[TOTAL_GC_TIME_%], Time(%), 0.48746518105849584
[READ], Operations, 5087
[READ], AverageLatency(us), 24.65421663062709
[READ], MinLatency(us), 13
[READ], MaxLatency(us), 1476
[READ], 95thPercentileLatency(us), 41
[READ], 99thPercentileLatency(us), 52
[READ], Return=OK, 5087
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 281.0
[CLEANUP], MinLatency(us), 281
[CLEANUP], MaxLatency(us), 281
[CLEANUP], 95thPercentileLatency(us), 281
[CLEANUP], 99thPercentileLatency(us), 281
[UPDATE], Operations, 94913
[UPDATE], AverageLatency(us), 27.787995322031755
[UPDATE], MinLatency(us), 12
[UPDATE], MaxLatency(us), 3569
[UPDATE], 95thPercentileLatency(us), 50
[UPDATE], 99thPercentileLatency(us), 70
[UPDATE], Return=OK, 94913